app/Models/M_Siswa.php

    public function getAllData2()
    {
        return $this->db->table('data_kegiatan')->get()->getResultArray();
---
SELECT *
FROM `data_kegiatan`

    public function get_id_user($id)
    {

        return $this->db->table('user')->where('id', $id)->get()->getRow();
---
SELECT *
FROM `user`
WHERE `id` = '1'